<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"c517c5cb279cc54c32198fd105c6cb823b05efe4a812c69e33d0629a27aedbd8","plan_job_ref":"Job Infrastructure #202 at https://github.com/coverage-robot/core/actions/runs/6280056511","plan_hash":"35a599b15bbe77b8431f2099061ca5fdc248c9e6979d7f716aaccfe46c0f25d2","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.queue.aws_sqs_queue.webhooks_queue will be created
  + resource "aws_sqs_queue" "webhooks_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = "messageGroup"
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = "perMessageGroupId"
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "coverage-webhooks-prod.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ line_coverage_table       = {
      ~ etag                        = "Bll6ZGlPVDpc/x02q7h4nw==" -> "djSE5T6JvoUsHFW1oXW/mA=="
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
      ~ labels                      = null -> {}
      ~ last_modified_time          = 1693775867511 -> 1695334808739
      ~ num_bytes                   = 0 -> 229225864
      ~ num_rows                    = 0 -> 588403
        # (21 unchanged attributes hidden)
    }
  + webhooks_queue            = {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = "messageGroup"
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = "perMessageGroupId"
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = null
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "coverage-webhooks-prod.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = null
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }
```
</details>

:memo: Plan generated in [Infrastructure #202](https://github.com/coverage-robot/core/actions/runs/6280056511)